And there you go , successfully created the VM using terraform, and ssh-ed into it : 

```bash
bash-5.0$ terraform apply
aws_eip.eip: Refreshing state... [id=eipalloc-05b873daf3c819770]
aws_security_group.allow_all: Refreshing state... [id=sg-062754286cd34e96e]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eip_association.eip_assoc will be created
  + resource "aws_eip_association" "eip_assoc" {
      + allocation_id        = "eipalloc-05b873daf3c819770"
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

  # aws_instance.creshVM will be created
  + resource "aws_instance" "creshVM" {
      + ami                          = "ami-0ebc281c20e89ba4b"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t3.micro"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = "creshKeyPair"
      + network_interface_id         = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + security_groups              = [
          + "allow_ssh",
        ]
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "Env" = "creshdemo"
        }
      + tenancy                      = (known after apply)
      + volume_tags                  = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.allow_all is tainted, so must be replaced
-/+ resource "aws_security_group" "allow_all" {
      ~ arn                    = "arn:aws:ec2:eu-west-3:794026459452:security-group/sg-062754286cd34e96e" -> (known after apply)
        description            = "Managed by Terraform"
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-062754286cd34e96e" -> (known after apply)
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        name                   = "allow_ssh"
      ~ owner_id               = "794026459452" -> (known after apply)
        revoke_rules_on_delete = false
      - tags                   = {} -> null
      ~ vpc_id                 = "vpc-01041268" -> (known after apply)
    }

Plan: 3 to add, 0 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_security_group.allow_all: Destroying... [id=sg-062754286cd34e96e]
aws_security_group.allow_all: Destruction complete after 0s
aws_security_group.allow_all: Creating...
aws_security_group.allow_all: Creation complete after 1s [id=sg-073c21ceaaea2c4ae]
aws_instance.creshVM: Creating...
aws_instance.creshVM: Still creating... [10s elapsed]
aws_instance.creshVM: Creation complete after 12s [id=i-0c1aa24940a746cdf]
aws_eip_association.eip_assoc: Creating...
aws_eip_association.eip_assoc: Creation complete after 1s [id=eipassoc-04ab21b62f4daf6df]

Apply complete! Resources: 3 added, 0 changed, 1 destroyed.

Outputs:

arn = arn:aws:ec2:eu-west-3:794026459452:instance/i-0c1aa24940a746cdf
availability_zone = eu-west-3b
credit_specification = [
  {
    "cpu_credits" = "unlimited"
  },
]
ebs_block_device_volume_ids = []
id = i-0c1aa24940a746cdf
instance_state = running
ipv6_addresses = []
key_name = creshKeyPair
password_data = 
placement_group = 
primary_network_interface_id = eni-084abc593d83061b3
private_dns = ip-172-31-17-177.eu-west-3.compute.internal
private_ip = 172.31.17.177
public_dns = ec2-35-180-35-250.eu-west-3.compute.amazonaws.com
public_ip = 35.180.35.250
root_block_device_volume_ids = [
  [
    "vol-07eb86ea0f4a1d8fd",
  ],
]
security_groups = [
  "allow_ssh",
]
subnet_id = subnet-8aa7f3f1
tags = {
  "Env" = "creshdemo"
}
vm_id = i-0c1aa24940a746cdf
volume_tags = {}
vpc_security_group_ids = [
  "sg-073c21ceaaea2c4ae",
]
bash-5.0$ ping
BusyBox v1.31.1 () multi-call binary.

Usage: ping [OPTIONS] HOST

Send ICMP ECHO_REQUEST packets to network hosts

	-4,-6		Force IP or IPv6 name resolution
	-c CNT		Send only CNT pings
	-s SIZE		Send SIZE data bytes in packets (default 56)
	-i SECS		Interval
	-A		Ping as soon as reply is recevied
	-t TTL		Set TTL
	-I IFACE/IP	Source interface or IP address
	-W SEC		Seconds to wait for the first response (default 10)
			(after all -c CNT packets are sent)
	-w SEC		Seconds until ping exits (default:infinite)
			(can exit earlier with -c CNT)
	-q		Quiet, only display output at start
			and when finished
	-p HEXBYTE	Pattern to use for payload
bash-5.0$ ping -c 4 google.fr
PING google.fr (216.58.215.35): 56 data bytes
ping: permission denied (are you root?)
bash-5.0$ sudo ping -c 4 google.fr
PING google.fr (216.58.215.35): 56 data bytes
64 bytes from 216.58.215.35: seq=0 ttl=52 time=2.758 ms
64 bytes from 216.58.215.35: seq=1 ttl=52 time=3.036 ms
64 bytes from 216.58.215.35: seq=2 ttl=52 time=3.200 ms
64 bytes from 216.58.215.35: seq=3 ttl=52 time=3.065 ms

--- google.fr ping statistics ---
4 packets transmitted, 4 packets received, 0% packet loss
round-trip min/avg/max = 2.758/3.014/3.200 ms
bash-5.0$ sudo ping -c 4 15.236.100.161
PING 15.236.100.161 (15.236.100.161): 56 data bytes
64 bytes from 15.236.100.161: seq=0 ttl=241 time=3.109 ms
64 bytes from 15.236.100.161: seq=1 ttl=241 time=3.121 ms
64 bytes from 15.236.100.161: seq=2 ttl=241 time=3.099 ms
^C
--- 15.236.100.161 ping statistics ---
3 packets transmitted, 3 packets received, 0% packet loss
round-trip min/avg/max = 3.099/3.109/3.121 ms
bash-5.0$ ls -zllh
ls: unrecognized option: z
BusyBox v1.31.1 () multi-call binary.

Usage: ls [-1AaCxdLHRFplinshrSXvctu] [-w WIDTH] [FILE]...

List directory contents

	-1	One column output
	-a	Include entries which start with .
	-A	Like -a, but exclude . and ..
	-x	List by lines
	-d	List directory entries instead of contents
	-L	Follow symlinks
	-H	Follow symlinks on command line
	-R	Recurse
	-p	Append / to dir entries
	-F	Append indicator (one of */=@|) to entries
	-l	Long listing format
	-i	List inode numbers
	-n	List numeric UIDs and GIDs instead of names
	-s	List allocated blocks
	-lc	List ctime
	-lu	List atime
	--full-time	List full date and time
	-h	Human readable sizes (1K 243M 2G)
	--group-directories-first
	-S	Sort by size
	-X	Sort by extension
	-v	Sort by version
	-t	Sort by mtime
	-tc	Sort by ctime
	-tu	Sort by atime
	-r	Reverse sort order
	-w N	Format N columns wide
	--color[={always,never,auto}]	Control coloring
bash-5.0$ ls -allh
total 96K    
drwxr-xr-x    3 beeio    bumblebe    4.0K Mar 26 23:49 .
drwxr-xr-x   10 beeio    bumblebe    4.0K Mar 26 23:46 ..
drwxr-xr-x    3 beeio    bumblebe    4.0K Mar 26 23:46 .terraform
-rw-r--r--    1 beeio    bumblebe    1.9K Mar 26 23:46 README.md
-rw-r--r--    1 beeio    bumblebe       0 Mar 26 23:46 aws.creshkey.pem
-rw-r--r--    1 beeio    bumblebe      24 Mar 26 23:46 aws.creshkey.pub
-rw-r--r--    1 beeio    bumblebe    4.6K Mar 26 23:46 k8s.cresh.provision.plan.terraplan
-rw-r--r--    1 beeio    bumblebe    8.8K Mar 26 23:46 kubeone-config.full.yaml
-rw-r--r--    1 beeio    bumblebe     130 Mar 26 23:46 kubeone-config.yaml
-rw-r--r--    1 beeio    bumblebe    1.1K Mar 26 23:46 kubeone.prepare.terraform.init.logs
-rw-r--r--    1 beeio    bumblebe    8.5K Mar 26 23:46 kubeone.prepare.terraform.plan.logs
-rwxr-xr-x    1 beeio    bumblebe    1.7K Mar 26 23:48 main.tf
-rwxr-xr-x    1 beeio    bumblebe    3.6K Mar 26 23:46 output.tf
-rw-r--r--    1 beeio    bumblebe    8.5K Mar 26 23:49 terraform.tfstate
-rw-r--r--    1 beeio    bumblebe    2.7K Mar 26 23:49 terraform.tfstate.backup
-rwxr-xr-x    1 beeio    bumblebe     718 Mar 26 23:46 terraform.tfvars
-rwxr-xr-x    1 beeio    bumblebe     521 Mar 26 23:46 variables.tf
-rw-r--r--    1 beeio    bumblebe      48 Mar 26 23:46 versions.tf
bash-5.0$ ssh -i ./aws.creshkey.pem ec2-user@15.236.100.161
The authenticity of host '15.236.100.161 (15.236.100.161)' can't be established.
ECDSA key fingerprint is SHA256:DsXFJrOhxJz3qrSMsHLVJdk+zqydPThZ0fHLGbymRDQ.
Are you sure you want to continue connecting (yes/no/[fingerprint])? yes
Warning: Permanently added '15.236.100.161' (ECDSA) to the list of known hosts.
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@         WARNING: UNPROTECTED PRIVATE KEY FILE!          @
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
Permissions 0644 for './aws.creshkey.pem' are too open.
It is required that your private key files are NOT accessible by others.
This private key will be ignored.
Load key "./aws.creshkey.pem": bad permissions
ec2-user@15.236.100.161: Permission denied (publickey).
bash-5.0$ hostname
7ee64abd7bb1
bash-5.0$ ip addr
1: lo: <LOOPBACK,UP,LOWER_UP> mtu 65536 qdisc noqueue state UNKNOWN qlen 1
    link/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00
    inet 127.0.0.1/8 scope host lo
       valid_lft forever preferred_lft forever
148: eth0@if149: <BROADCAST,MULTICAST,UP,LOWER_UP,M-DOWN> mtu 1500 qdisc noqueue state UP 
    link/ether 02:42:ac:16:00:02 brd ff:ff:ff:ff:ff:ff
    inet 172.22.0.2/16 brd 172.22.255.255 scope global eth0
       valid_lft forever preferred_lft forever
bash-5.0$ ssh -i ./aws.creshkey.pem ec2-user@15.236.100.161
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@         WARNING: UNPROTECTED PRIVATE KEY FILE!          @
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
Permissions 0644 for './aws.creshkey.pem' are too open.
It is required that your private key files are NOT accessible by others.
This private key will be ignored.
Load key "./aws.creshkey.pem": bad permissions
ec2-user@15.236.100.161: Permission denied (publickey).
bash-5.0$ chmod 600 ./aws.creshkey.pem 
bash-5.0$ ssh -i ./aws.creshkey.pem ec2-user@15.236.100.161
Load key "./aws.creshkey.pem": invalid format
ec2-user@15.236.100.161: Permission denied (publickey).
bash-5.0$ chmod 600 ./aws.creshkey.pem 
bash-5.0$ rm ./aws.creshkey.pem 
bash-5.0$ vi ./aws.creshkey.pem 
bash-5.0$ chmod 600 ./aws.creshkey.pem 
bash-5.0$ ssh -i ./aws.creshkey.pem ec2-user@15.236.100.161

       __|  __|_  )
       _|  (     /   Amazon Linux AMI
      ___|\___|___|

https://aws.amazon.com/amazon-linux-ami/2018.03-release-notes/
[ec2-user@ip-172-31-17-177 ~]$ hostname
ip-172-31-17-177
[ec2-user@ip-172-31-17-177 ~]$ ls -allh ~/.ssh/
total 12K
drwx------ 2 ec2-user ec2-user 4.0K Mar 26 23:49 .
drwx------ 3 ec2-user ec2-user 4.0K Mar 26 23:49 ..
-rw------- 1 ec2-user ec2-user  394 Mar 26 23:49 authorized_keys
[ec2-user@ip-172-31-17-177 ~]$ pwd
/home/ec2-user
[ec2-user@ip-172-31-17-177 ~]$ ip addr
1: lo: <LOOPBACK,UP,LOWER_UP> mtu 65536 qdisc noqueue state UNKNOWN group default qlen 1000
    link/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00
    inet 127.0.0.1/8 scope host lo
       valid_lft forever preferred_lft forever
    inet6 ::1/128 scope host 
       valid_lft forever preferred_lft forever
2: eth0: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 9001 qdisc mq state UP group default qlen 1000
    link/ether 0a:b1:ea:81:78:92 brd ff:ff:ff:ff:ff:ff
    inet 172.31.17.177/20 brd 172.31.31.255 scope global eth0
       valid_lft forever preferred_lft forever
    inet6 fe80::8b1:eaff:fe81:7892/64 scope link 
       valid_lft forever preferred_lft forever
[ec2-user@ip-172-31-17-177 ~]$ whoami
ec2-user
[ec2-user@ip-172-31-17-177 ~]$ sudo -s
[root@ip-172-31-17-177 ec2-user]# exit
exit
[ec2-user@ip-172-31-17-177 ~]$ 

```